[
  {
    "title": "Considering Postgraduate Study?",
    "date": "April 30, 2020",
    "link": "https://aru.ac.uk/blogs/considering-postgraduate-study",
    "source": "Anglia Ruskin University",
    "excerpt": "In these uncertain times, we may be reluctant to make plans for the future that might need to change at the drop of a hat. For some of you, who are concerned that the job market is unpredictable, thoughts may turn to postgraduate study as a possible next step."
  },
  {
    "title": "Major Upcoming Software Releases",
    "date": "April 15, 2020",
    "link": "https://ruskinjournal.com/2020/04/15/major-upcoming-software-releases/",
    "source": "The Ruskin Journal",
    "excerpt": "2020 will be a hectic year for some of the world’s largest software companies. Each of the three top operating systems, including Windows, macOS, and Ubuntu Linux, will see significant new releases either within the next few weeks, or within the next five months in Apple’s case."
  },
  {
    "title": "The Ruskin Journal ft. Creative Writing Society Open Mic Night",
    "date": "February 28, 2020",
    "link": "https://ruskinjournal.com/2020/02/28/the-ruskin-journal-ft-creative-writing-society-open-mic/",
    "source": "The Ruskin Journal",
    "excerpt": "On Friday 21st February, both The Ruskin Journal and the Creative Writing Society co-hosted an open mic event as part of LGBTQ+ History Month. For those of you that couldn’t attend, the event took place between 7 o’clock and 10 o’clock in The Academy hall on Cambridge campus."
  },
  {
    "title": "Cambridge to Host Upcoming Global Health Conference",
    "date": "February 17, 2020",
    "link": "https://ruskinjournal.com/2020/02/17/cambridge-to-host-upcoming-global-health-conference/",
    "source": "The Ruskin Journal",
    "excerpt": "On 19th March, Cambridge Global Health Partnerships will be hosting their second Global Health Conference since it’s debut back in 2018. This year’s event has been touted to be larger and more featureful than the previous event, with more guest speakers, panels and exhibitors attending at Hughes Hall, Cambridge University."
  },
  {
    "title": "Extinction Rebellion Plan to Bring City to a Halt in Latest Protest",
    "date": "February 11, 2020",
    "link": "https://ruskinjournal.com/2020/02/11/extinction-rebellion-plan-to-bring-city-to-a-halt-in-latest-protest/",
    "source": "The Ruskin Journal",
    "excerpt": "In the last few days, media outlets throughout Cambridge – including The Ruskin Journal – have been made aware of Extinction Rebellion’s plan to ‘bring the city to a halt’ with a ‘week-long roadblock’ should the ‘institutions of Cambridge’ fail to acquiesce to the group’s demands."
  },
  {
    "title": "What’s On: Cambridge – Competitive Escape Room League",
    "date": "January 30, 2020",
    "link": "https://ruskinjournal.com/2020/01/30/whats-on-cambridge-competitive-escape-room-league/",
    "source": "The Ruskin Journal",
    "excerpt": "Between January 13th and July 12th, Lockhouse Games are hosting their inaugural Escape Room League. Throughout the second semester, each of the universities of Cambridge will compete against each other to see who can complete Lockhouse’s three escape rooms the quickest."
  },
  {
    "title": "Students, Alumni & Staff Pen Open Letter to University Governors",
    "date": "December 12, 2019",
    "link": "https://ruskinjournal.com/2019/12/10/students-alumni-staff-pen-open-letter-to-university-governors/",
    "source": "The Ruskin Journal",
    "excerpt": "Since August, 155 students, staff members, and university alumni have signed an open letter addressed to the Governors of the university, citing concern with the Chair of Governors decision to become a Trustee to The Global Warming Policy Foundation, known as the GWPF."
  },
  {
    "title": "Match Report: Team ARU versus Loughborough – Ultimate Frisbee",
    "date": "December 6, 2019",
    "link": "https://ruskinjournal.com/2019/12/06/match-report-team-aru-versus-loughborough-ultimate-frisbee/",
    "source": "The Ruskin Journal",
    "excerpt": "On Wednesday the 20th of November, the university’s Ultimate Frisbee Team played an away match against Loughborough University. The 3rds game kicked-off at around 3:30 PM with Team ARU on the defence and Loughborough playing aggressively from the get-go."
  },
  {
    "title": "Calling All Students: Make Your Voice Heard!",
    "date": "November 13, 2020",
    "link": "https://ruskinjournal.com/2019/11/13/calling-all-students-make-your-voice-heard/",
    "source": "The Ruskin Journal",
    "excerpt": "As I’m sure you know by now, another general election is upon us. Though it seems like an eternity since we last went to the polls, on December 12th the country will be asked once again to decide it’s future."
  }
]
